#请在每行右侧用单行注释写出名称(6)
6#整数
6.0#float
'6'#string
[1,2,3]#list
(1,2,3)#tuple
{1:'a',2:'b'}#dict
{2,4,7,9}#set


#请在每行右侧用单行注释写出运算结果(15)
2+3#5
3+5.0#8.0
[1,2,3]+[4,5,6]#[1, 2, 3, 4, 5, 6]
(1,2,3)+(4,)#(1, 2, 3, 4)
3*5.0#15.0
'abc'*3#'abcabcabc'
[1,2,3]*2#[1, 2, 3, 1, 2, 3]
(1,2,3,4)*2#(1, 2, 3, 4, 1, 2, 3, 4)
3/2#1.5
15//4#3
9.0//2#3.0
(-9)//2#-5
9%2#1
36%12#3
4**2#16
9**0.5#3.0

list1=[1,2,3]
list1.append([5,6,7])  # 22、注释末尾写出左边两行执行后的list1内容 #[1, 2, 3, [5, 6, 7]]


list1=[1,2,3,4,5]
list2=list1[2:-1]#23、注释末尾写出左边两行执行后的list2的内容 #[3, 4]


#补全代码
# 24 25、变量a获得从键盘输入个人姓名，变量a翻转后赋值给b
a=input()
b=a[-1:0:-1]+a[0]

# 26、变量b获得从键盘输入的整数
b=int(input())

# 27、从键盘输入字符串创建列表list1
list1=list(input().split(' '))

# 28、列表list1从键盘输入整体追加多个字符串元素
list1.extend(input().split(' '))

#29、元组tup1从键盘输入整数属性多个元素
tup1=tuple(map(int,input().split()))

#30、把列表list1转换为元组tup1
tup1=list1

#31、把元组tup1去重，注意最后得到的是去重后的元组tup1
tup1=tuple(set(tup1))

#32、字典dict1更新键名为'A'的键值为个人学号，要求键名存在也能更新
dict1['A']=2

#33、统计列表list1中整数3的个数
list1=[2,3,4,2,3,5,6,7,8,9,3,4,5,6,7,8]
ans=list1.count(3)

#34、列表list1中去掉一个最大值后的平均数
ans=(sum(list1)-max(list1))/(len(list1)-1)

#35、补全print()，要求输出保留两位小数的变量a
print("{:.1f}".format(a))
